HZ_MAP: dict[str, float] = {
    "Hz": 1,
    "kHz": 1e3,
    "MHz": 1e6,
    "GHz": 1e9,
    "THz": 1e12,
}

BYTES_MAP: dict[str, float] = {
    "b": 0.125,
    "B": 1,
    "kB": 1024,
    "KiB": 1000,
    "KB": 1024,
    "MB": 1024**2,
    "MiB": 1000**2,
    "GB": 1024**3,
    "GiB": 1000**3,
    "TB": 1024**4,
    "TiB": 1000**4,
    "PB": 1024**5,
    "PiB": 1000**5,
}

TIME_MAP: dict[str, float] = {
    "s": 1,
    "min": 60,
    "h": 3600,
    "d": 86400,
    "cs": 0.01,
    "ms": 0.001,
    "µs": 0.000_001,
    "ns": 0.000_000_001,
    "ps": 0.000_000_000_001,
}
